CAnimationVariableIntegerChangeHandler.OnIntegerValueChanged(IUIAnimationStoryboard*,IUIAnimationVariable*,System.Int32,System.Int32)
Called when a value of an animation variable has changed.
Returns:
S_OK if the method succeeds; otherwise E_FAIL.
storyboard: The storyboard that is animating the variable.
variable: The animation variable that was updated.
newValue: The new rounded value.
previousValue: The previous rounded value.

CAnimationVariableIntegerChangeHandler.SetAnimationController(CAnimationController*)
Stores a pointer to animation controller to route events.
pAnimationController: A pointer to animation controller, which will receive events.

CAnimationVariableIntegerChangeHandler.CreateInstance(CAnimationController*,IUIAnimationVariableIntegerChangeHandler**)
Creates an instance of CAnimationVariableIntegerChangeHandler callback.
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pAnimationController: A pointer to animation controller, which will receive events.
ppHandler: Output. If the method succeeds it contains a pointer to COM object that will handle
variable integer change events.

CAnimationVariableIntegerChangeHandler.#ctor
Constructs a CAnimationVariableIntegerChangeHandler object.

CAnimationVariableIntegerChangeHandler
Implements a call back, which is called by Animation API when the value of an animation variable changes.
Remarks:
This event handler is created and passed to IUIAnimationVariable::SetVariableIntegerChangeHandler method,
when you call CAnimationVariable::EnableIntegerValueChangedEvent or CAnimationBaseObject::EnableIntegerValueChangedEvent
(which enables this event for all animation variables encapsulated in an animation object).